OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (2e-3 0 0)
    (2e-3 0.01e-3 0)
    (0 0.01e-3 0)
    (0 0 2e-3)
    (2e-3 0 2e-3)
    (2e-3 0.01e-3 2e-3)
    (0 0.01e-3 2e-3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 200) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    leftWall
    {
        type symmetryPlane;
        faces
        (
            (0 4 7 3)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	    (1 5 4 0)
            (3 7 6 2)
        );
    }

    solidInterface
    {   
        type patch;
        faces
        ();
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
