OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/PositionvsTime
(
   (0		(0 0.05e-3 0))
   (0.003    (0 0.05e-3 0))
)
