OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/PowervsTime
(
   (0		1967)
   (0.003 1967)
   (0.00301 	0)
)
