OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/laserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      laserProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
	r0		  0.428e-3;
	kappaM		  0.25;
	emS		  0.2;
	emL		  0.2;
	laserPatchName	  topWall;

	laserPowerSeries
	{
	    outOfBounds    clamp;
	    fileName	   "$FOAM_CASE/constant/PowervsTime";
	}

	laserPositionSeries
	{
	    outOfBounds    clamp;
	    fileName	   "$FOAM_CASE/constant/PositionvsTime";
	}
// ************************************************************************* //
