OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/plasticStrainVsYieldStress
(
    (0.000    1e99)
)
