OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/rheologyProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      rheologyProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress     no;

rheology
{
    type            linearElastic;
    rho             rho [1 -3 0 0 0 0 0] 960;
    E               E [1 -1 -2 0 0 0 0] 3e+9;   
    nu              nu [0 0 0 0 0 0 0] 0.35;        
}

rho             rho [1 -3 0 0 0 0 0] 960;
E               E [1 -1 -2 0 0 0 0] 3e+9;   
nu              nu [0 0 0 0 0 0 0] 0.35; 
"file|fileName" "$FOAM_CASE/constant/plasticStrainVsYieldStress";
outOfBounds     clamp;

// ************************************************************************* //
