OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

MetalProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.4e-5;
    rhoS            7200;
    rhoL            7200;
}

GasProperties
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-5; //gas properties from Wang et al
    rhoG            1.6337;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 1.4;
STgrad		STgrad [1 0 -2 -1 0 0 0] -4.3e-4;

// ************************************************************************* //
