OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    rightWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftWall
    {
        type            symmetryPlane;
    }

    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    solidInterface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
