OpenFOAM/thermofluid/tutorials/deprecatedTutorials/HeValidationCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         extendedLeastSquares 0; //cellLimited leastSquares 1;
    grad(U)         leastSquares;
    grad(alpha.material) Gauss linear; //leastSquares;  
    grad(T)         leastSquares;
    grad(gT)	    leastSquares;
}

divSchemes
{
    default	    none;
    div(rhoPhi,U)   Gauss upwind;
    //div(phi,alpha)  Gauss linearUpwind grad(alpha.material);
    //div(phirb,alpha) Gauss interfaceCompression;
    div(phi,T) 	    Gauss vanLeer;
    div(rhoMPhi,gT) Gauss linearUpwind grad(gT);
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
